{"1.1.2":{"en":"## Major Changes and Improvements\n\n### **Change**: Architectural rewrite\nLarge parts of the backend have been reworked to allow dependency injection and smaller build outputs.\n\n## Minor Changes\n\n### User Interface\n- **Fix**: After the app was started, newly added/changed devices with a non-temperature capability were visible in the settings screen. #45\n- **Add**: A link to the homepage has been added in the app's menu #32 \n- **Change**: Better support for smaller devices. Removed time popup in favor of html input=time #41 \n- **Change**: Lists show an empty message #9  \n\n### App\n\n### Backend\n- **Fix**: The backend could not apply target temperatures as the values have accidently been provided as string instead of number #42, #38, #22\n- **Add**: Out of season mode #43\n- **Change** Set temperature now checks min, max, stepsize of device and adjusts the value accordingly\n\n\n\n"},"1.1.1":{"en":"## Major Changes and Improvements\n\n### **Change**: Optimized device identification (#34)\nNow, all devices are available that support the `target_temperature` capability.\n\n### **Fix**: Target temperatures are not changing (#22, #23, #38)\nWorkarounds for issues while using `CapabilityInstance`. Code is now using `setCapabilityValue`, with exponential retries. This seems to work quite stable.\n\n### **Change**: Architectural rewrite\nLarge parts of the UI have been reworked to workaround issues on iOS Safari: Input focus, wrong resizing for fixed divs, blocking of scrolling behind popups, ...\n\n## Minor Changes\n\n### User Interface\n- **Change**: Current temperature page shows better formatting and a comparison between temperature and setpoint values #27\n- **Add**: Unnamed plan is displayed as long as the plan has no name #28\n- **Add**: Heating modes can now be changed from the overview page #33 \n- **Fix**: Removed unnecessary \"/\" in header of a dialog #36\n- **Change**: All setpoints now always show temperature with .0 digits #35 \n- **Add**: Toasts are shown after important actions e.g. save, remove, ... #17 \n- **Fix**: Copied schedules are now correctly aligned to the day #19 \n\n### App\n- **Add**: Mode changes are now posted to the timeline #33\n- **Add**: Zone and devices changes are now honored, no App restart required #16 \n\n### Backend\n- **Fix**: Api logging is now also correctly reset when flipping settings #37 \n"},"1.2.0":{"en":"## Major Changes and Improvements\n\n### **Add**: Translation to Dutch #30\nProud to have a dutch version now - many thanks to Lennard Warnaar for reviewing Google's best try.\n\n### **Add**: Virtual thermostats #29\nEach plan can be added as a virtual thermostat device to Homey. This allows to override the temperature per \"zone\" independent of the associated schedule.\n\nThe virtual device comes with the following capabilities\n- `thermostat_override` This allows to define what happens when the target temperature is changed, independent of the plan's schedule. The value can be kept either until end of the day, or forever (which disables the plan).\n- `target_temperature` Sets that value for all devices associated with the plan\n- `measured_temperature` Shows the mean value of all temperature readings from all devices related to the plan\n\nAll of them are available as flow triggers.\n\n#### How to implement open window detection with the virtual device? #29\n- Add a flow that triggers on `open` of any of the room's windows\n- On `open`, set temperature of associated heating plan to, e.g. 6°\n- When the switch is `closed`, reset the `thermostat_override` to automatic and you're done.\n\n### **Add**: Graphical plan overview #44\nThere is now a graphical overview of your schedule directly available on the summary of the plan. Also, the plan editing screen has been reworked to fit the more dense information.\n\n<screenshots>\n    <screenshot>\n        <img src=\"../assets/screens/schedule.png\" />\n        <div>Overview</div>\n    </screenshot>\n</screenshots>\n\n## Minor Changes\n\n### User Interface\n- **Change**: The initial bootstrapping of the web application has been made faster by reducing the package size.\n- **Fixed**: Endless loop when creating new plans.\n\n### App\n- **Add**: Triggers for heating mode change\n- **Add**: Notifcations can be tured off now in the settings #52\n\n### Backend\n- **Add**: Sentry.io has been added. You can opt-out through the settings page.\n- **Fix**: Some devices don't report a step size for the `target_temperature`. A workarround has been implemented. #54\n- **Change**: Replaced console-remote-logger with own implementation. Too much vulnerable dependencies that could not easily be cleanup."},"1.2.1":{"en":"## Minor Changes\n- Schema for app.json silently changed #83\n\n### User Interface\n- Help now opens in new browser window\n\n### Backend\n- Scheduler took wrong decision for schedules with only one element on the same day\n- Removed some code duplications\n"},"1.2.2":{"en":"## Improvements\n- German translations\n\n## Fixes\n- During device removal, OnInit cycle of the driver seems not to be run. A workaround has been implemented #94\n- Try to implement a workaround for #68. Danfoss seems to reject temperature if it is already set.\n- Check if a device is available before setting target_temperature, #95\n- Added safety check for remote logging buffer overflow, resolves #85\n- 'Device not ready' errors disappear after bumping all Homey dependencies, fixes #120\n\n## Backend\n- Bumped dependencies (d3, material-ui, mocha, @types/*)"},"1.2.3":{"en":"## Fixes\n- Fixed issue in variable replacements for German translations\n- Improve recognition of device initialization errors\n- Reworked german translations to informal salutations\n- De-/Activation of heating-plans did not update overview page #140"},"1.2.4":{"en":"## Fixes (same as 1.2.3)\n- Fixed issue in variable replacements for German translations\n- Improve recognition of device initialization errors\n- Reworked german translations to informal salutations\n- De-/Activation of heating-plans did not update overview page #140\n\n## Docs\nUpdated README.txt and forced to bump version due to Apps Store requirements."},"2.0.0":{"en":"## Docs\nCompatibility with Homey 3.0 SDK"}}